SmingHub/Sming/Sming/Arch/Esp32/Components/driver/uart.cpp
/*
 uart.cpp - esp32 UART HAL
 */

// These conflict with enumerated types defined in IDF
#define UART_PARITY_NONE IDF_UART_PARITY_NONE
#define UART_PARITY_EVEN IDF_UART_PARITY_EVEN
#define UART_PARITY_ODD IDF_UART_PARITY_ODD
#include <hal/uart_ll.h>
#undef UART_PARITY_NONE
#undef UART_PARITY_EVEN
#undef UART_PARITY_ODD

#include <driver/uart.h>
#include <driver/SerialBuffer.h>
#include <driver/periph_ctrl.h>
#include <soc/uart_channel.h>
#include <soc/uart_periph.h>
#include <BitManipulations.h>
#include <Data/Range.h>
#include <esp_systemapi.h>
#include <hal/gpio_ll.h>

#if UART_ID_SERIAL_USB_JTAG
#include "hal/usb_serial_jtag_ll.h"
#include "hal/usb_fsls_phy_ll.h"
#if !SOC_RCC_IS_INDEPENDENT
#define USJ_RCC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#define USJ_RCC_ATOMIC()
#endif
#endif

namespace
{
// Ensure global values correspond to hardware values (may break when new variants added)
#define CHECK_STATUS_BIT(smg_name, idf_name)                                                                           \
	static_assert(int(smg_name) == int(idf_name), "Esp32 value mismatch for " #smg_name);
CHECK_STATUS_BIT(UART_STATUS_TX_DONE, UART_INTR_TX_DONE)
CHECK_STATUS_BIT(UART_STATUS_RXFIFO_TOUT, UART_INTR_RXFIFO_TOUT)
CHECK_STATUS_BIT(UART_STATUS_BRK_DET, UART_INTR_BRK_DET)
CHECK_STATUS_BIT(UART_STATUS_CTS_CHG, UART_INTR_CTS_CHG)
CHECK_STATUS_BIT(UART_STATUS_DSR_CHG, UART_INTR_DSR_CHG)
CHECK_STATUS_BIT(UART_STATUS_RXFIFO_OVF, UART_INTR_RXFIFO_OVF)
CHECK_STATUS_BIT(UART_STATUS_FRM_ERR, UART_INTR_FRAM_ERR)
CHECK_STATUS_BIT(UART_STATUS_PARITY_ERR, UART_INTR_PARITY_ERR)
CHECK_STATUS_BIT(UART_STATUS_TXFIFO_EMPTY, UART_INTR_TXFIFO_EMPTY)
CHECK_STATUS_BIT(UART_STATUS_RXFIFO_FULL, UART_INTR_RXFIFO_FULL)

/*
 * Parameters relating to RX FIFO and buffer thresholds
 *
 * 'headroom' is the number of characters which may be received before a receive overrun
 * condition occurs and data is lost.
 *
 * For the hardware FIFO, data is processed via interrupt so the headroom can be fairly small.
 * The greater the headroom, the more interrupts will be generated thus reducing efficiency.
 */
#define RX_FIFO_FULL_THRESHOLD 120									  ///< UIFF interrupt when FIFO bytes > threshold
#define RX_FIFO_HEADROOM (UART_RX_FIFO_SIZE - RX_FIFO_FULL_THRESHOLD) ///< Chars between UIFF and UIOF
/*
 * Using a buffer, data is typically processed via task callback so requires additional time.
 * This figure is set to a nominal default which should provide robust operation for most situations.
 * It can be adjusted if necessary via the rx_headroom parameter.
*/
#define DEFAULT_RX_HEADROOM (32 - RX_FIFO_HEADROOM)

int s_uart_debug_nr = UART_NO;

// Keep track of interrupt enable state for each UART
uint8_t isrMask;

struct smg_uart_pins_t {
	uint8_t tx;
	uint8_t rx;
};

#ifdef SOC_ESP32
#define UART0_PIN_DEFAULT UART_NUM_0_TXD_DIRECT_GPIO_NUM, UART_NUM_0_RXD_DIRECT_GPIO_NUM
#define UART1_PIN_DEFAULT 18, 19 // Defaults conflict with flash
#define UART2_PIN_DEFAULT UART_NUM_2_TXD_DIRECT_GPIO_NUM, UART_NUM_2_RXD_DIRECT_GPIO_NUM
#elif defined(SOC_ESP32C3)
#define UART0_PIN_DEFAULT 21, 20
#define UART1_PIN_DEFAULT 10, 9
#elif defined(SOC_ESP32S2)
#define UART0_PIN_DEFAULT 43, 44
#define UART1_PIN_DEFAULT UART_NUM_1_TXD_DIRECT_GPIO_NUM, UART_NUM_1_RXD_DIRECT_GPIO_NUM
#elif defined(SOC_ESP32S3)
#define UART0_PIN_DEFAULT 43, 44
#define UART1_PIN_DEFAULT UART_NUM_1_TXD_DIRECT_GPIO_NUM, UART_NUM_1_RXD_DIRECT_GPIO_NUM
#define UART2_PIN_DEFAULT 17, 16
#elif defined(SOC_ESP32C2)
#define UART0_PIN_DEFAULT UART_NUM_0_TXD_DIRECT_GPIO_NUM, UART_NUM_0_RXD_DIRECT_GPIO_NUM
#define UART1_PIN_DEFAULT 10, 9
#else
static_assert(false, "Must define default UART pins for selected ESP_VARIANT");
#endif

constexpr smg_uart_pins_t defaultPins[UART_COUNT] = {
	{UART0_PIN_DEFAULT},
	{UART1_PIN_DEFAULT},
#if UART_COUNT > 2
	{UART2_PIN_DEFAULT},
#endif
};

uart_dev_t* IRAM_ATTR getDevice(uint8_t uart_nr)
{
	if(uart_nr == 0) {
		return &UART0;
	}
	if(uart_nr == 1) {
		return &UART1;
	}
#if UART_COUNT > 2
	if(uart_nr == 2) {
		return &UART2;
	}
#endif
	assert(false);
	return nullptr;
}

// Keep a reference to all created UARTS
struct smg_uart_instance_t {
	smg_uart_t* uart;
	smg_uart_notify_callback_t callback;
	intr_handle_t handle;
};

smg_uart_instance_t uartInstances[UART_COUNT];

// Get number of characters in transmit FIFO
__forceinline size_t uart_txfifo_count(uart_dev_t* dev)
{
	return dev->status.txfifo_cnt;
}

// Get available free characters in transmit FIFO
__forceinline size_t uart_txfifo_free(uart_dev_t* dev)
{
	return UART_TX_FIFO_SIZE - uart_txfifo_count(dev) - 1;
}

// Return true if transmit FIFO is full
__forceinline bool uart_txfifo_full(uart_dev_t* dev)
{
	return uart_txfifo_count(dev) >= (UART_TX_FIFO_SIZE - 1);
}

/** @brief Invoke a port callback, if one has been registered
 *  @param uart
 *  @param code
 */
void notify(smg_uart_t* uart, smg_uart_notify_code_t code)
{
	auto callback = uartInstances[uart->uart_nr].callback;
	if(callback != nullptr) {
		callback(uart, code);
	}
}

/** @brief Determine if the given uart is a real uart or a virtual one
 */
__forceinline bool is_physical(int uart_nr)
{
	return (uart_nr >= 0) && (uart_nr < UART_PHYSICAL_COUNT);
}

__forceinline bool is_physical(smg_uart_t* uart)
{
	return uart != nullptr && is_physical(uart->uart_nr);
}

/** @brief Determine if the given uart is a standard UART
 */
__forceinline bool is_standard_uart(int uart_nr)
{
	return (uart_nr >= 0) && (uart_nr < SOC_UART_NUM);
}

__forceinline bool is_standard_uart(smg_uart_t* uart)
{
	return uart != nullptr && is_standard_uart(uart->uart_nr);
}

/** @brief If given a virtual uart, obtain the related physical standard uart
 */
smg_uart_t* get_standard_uart(smg_uart_t* uart)
{
	return is_standard_uart(uart) ? uart : nullptr;
}

#if UART_ID_SERIAL_USB_JTAG

/**
 * @brief Determine if the given uart is USB Serial JTAG
 */
__forceinline bool is_usb_serial_jtag(int uart_nr)
{
	return UART_ID_SERIAL_USB_JTAG && uart_nr == UART_ID_SERIAL_USB_JTAG;
}

__forceinline bool is_usb_serial_jtag(smg_uart_t* uart)
{
	return uart != nullptr && is_usb_serial_jtag(uart->uart_nr);
}

void IRAM_ATTR usb_serial_jtag_isr(smg_uart_instance_t* inst)
{
	if(inst == nullptr || inst->uart == nullptr) {
		return;
	}

	auto uart = inst->uart;
	// Value passed to user callback
	uint32_t status{0};

	uint32_t usbjtag_intr_status = usb_serial_jtag_ll_get_intsts_mask();

	if(usbjtag_intr_status & USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY) {
		status |= UART_INTR_TXFIFO_EMPTY;
		// Check if hardware fifo is available for writing
		if(!usb_serial_jtag_ll_txfifo_writable()) {
			usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);
		} else {
			usb_serial_jtag_ll_disable_intr_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);

			if(uart->tx_buffer != nullptr) {
				void* queued_buff;
				size_t queued_size = uart->tx_buffer->getReadData(queued_buff);

				usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);

				if(queued_size != 0) {
					size_t sent_size = usb_serial_jtag_ll_write_txfifo(static_cast<uint8_t*>(queued_buff), queued_size);
					uart->tx_buffer->skipRead(sent_size);
					usb_serial_jtag_ll_txfifo_flush();
					usb_serial_jtag_ll_ena_intr_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);
				}
			}
		}
	}

