SmingHub/Sming/Sming/Arch/Esp32/Components/driver/uart.cpp
	if(usbjtag_intr_status & USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT) {
		// Read hardware FIFO into ring buffer
		usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT);
		uint8_t rx_data_buf[USB_SERIAL_JTAG_PACKET_SZ_BYTES];
		size_t space = uart->rx_buffer->getFreeSpace();
		size_t to_read = std::min(space, size_t(USB_SERIAL_JTAG_PACKET_SZ_BYTES));
		size_t read = usb_serial_jtag_ll_read_rxfifo(rx_data_buf, to_read);
		space -= read;
		auto ptr = rx_data_buf;
		while(read-- != 0) {
			uart->rx_buffer->writeChar(*ptr++);
		}

		// Only invoke user callback when buffer is (almost) full
		if(space <= uart->rx_headroom) {
			status |= UART_INTR_RXFIFO_FULL;
		} else {
			// No hardware timeout available, we'd need to implement one
			status |= UART_INTR_RXFIFO_TOUT;
		}
	}

	// Keep a note of persistent flags - cleared via uart_get_status()
	uart->status |= status;

	if(status != 0 && uart->callback != nullptr) {
		uart->callback(uart, status);
	}
}

#endif

/*
 * Standard UART interrupt service routine
 */
void IRAM_ATTR uart_isr(smg_uart_instance_t* inst)
{
	if(inst == nullptr || inst->uart == nullptr) {
		return;
	}

	auto uart = inst->uart;
	auto dev = getDevice(uart->uart_nr);

	auto usis = dev->int_st.val;

	// If status is clear there's no interrupt to service on this UART
	if(usis == 0) {
		return;
	}

	// Value to be passed to callback
	auto status = usis;

	// Deal with the event, unless we're in raw mode
	if(!bitRead(uart->options, UART_OPT_CALLBACK_RAW)) {
		// Rx FIFO full or timeout
		if(usis & (UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT | UART_INTR_RXFIFO_OVF)) {
			size_t read = 0;

			// Read as much data as possible from the RX FIFO into buffer
			if(uart->rx_buffer != nullptr) {
				size_t avail = uart_ll_get_rxfifo_len(dev);
				size_t space = uart->rx_buffer->getFreeSpace();
				read = (avail <= space) ? avail : space;
				space -= read;
				uint8_t buf[UART_RX_FIFO_SIZE];
				uart_ll_read_rxfifo(dev, buf, read);
				uint8_t* ptr = buf;
				while(read-- != 0) {
					uart->rx_buffer->writeChar(*ptr++);
				}

				// Don't call back until buffer is (almost) full
				if(space > uart->rx_headroom) {
					status &= ~UART_INTR_RXFIFO_FULL;
				}
			}

			/*
			 * If the FIFO is full and we didn't read any of the data then need to mask the interrupt out or it'll recur.
			 * The interrupt gets re-enabled by a call to uart_read() or uart_flush()
			 */
			if(usis & UART_INTR_RXFIFO_OVF) {
				uart_ll_disable_intr_mask(dev, UART_INTR_RXFIFO_OVF);
			} else if(read == 0) {
				uart_ll_disable_intr_mask(dev, UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT);
			}
		}

		// Unless we replenish TX FIFO, disable after handling interrupt
		if(usis & UART_INTR_TXFIFO_EMPTY) {
			// Dump as much data as we can from buffer into the TX FIFO
			if(uart->tx_buffer != nullptr) {
				size_t space = uart_txfifo_free(dev);
				size_t avail = uart->tx_buffer->available();
				size_t count = std::min(avail, space);
				uint8_t buf[count];
				for(unsigned i = 0; i < count; ++i) {
					buf[i] = uart->tx_buffer->readChar();
				}
				uart_ll_write_txfifo(dev, buf, count);
			}

			// If TX FIFO remains empty then we must disable TX FIFO EMPTY interrupt to stop it recurring.
			if(uart_txfifo_count(dev) == 0) {
				// The interrupt gets re-enabled by uart_write()
				uart_ll_disable_intr_mask(dev, UART_INTR_TXFIFO_EMPTY);
			} else {
				// We've topped up TX FIFO so defer callback until next time
				status &= ~UART_INTR_TXFIFO_EMPTY;
			}
		}
	}

	// Keep a note of persistent flags - cleared via uart_get_status()
	uart->status |= status;

	if(status != 0 && uart->callback != nullptr) {
		uart->callback(uart, status);
	}

	// Final step is to clear status flags
	dev->int_clr.val = usis;
}

} // namespace

smg_uart_t* smg_uart_get_uart(uint8_t uart_nr)
{
	return (uart_nr < UART_COUNT) ? uartInstances[uart_nr].uart : nullptr;
}

uint8_t smg_uart_disable_interrupts()
{
	//	ETS_UART_INTR_DISABLE();
	return isrMask;
}

void smg_uart_restore_interrupts()
{
	if(isrMask != 0) {
		//		ETS_UART_INTR_ENABLE();
	}
}

bool smg_uart_set_notify(unsigned uart_nr, smg_uart_notify_callback_t callback)
{
	if(uart_nr >= UART_COUNT) {
		return false;
	}

	uartInstances[uart_nr].callback = callback;
	return true;
}

void smg_uart_set_callback(smg_uart_t* uart, smg_uart_callback_t callback, void* param)
{
	if(uart != nullptr) {
		uart->callback = nullptr; // In case interrupt fires between setting param and callback
		uart->param = param;
		uart->callback = callback;
	}
}

size_t smg_uart_read(smg_uart_t* uart, void* buffer, size_t size)
{
	if(!smg_uart_rx_enabled(uart) || buffer == nullptr || size == 0) {
		return 0;
	}

	notify(uart, UART_NOTIFY_BEFORE_READ);

	size_t read = 0;

	auto buf = static_cast<uint8_t*>(buffer);

	// First read data from RX buffer if in use
	if(uart->rx_buffer != nullptr) {
		while(read < size && !uart->rx_buffer->isEmpty())
			buf[read++] = uart->rx_buffer->readChar();
	}

	// Top up from hardware FIFO
	if(is_standard_uart(uart)) {
		auto dev = getDevice(uart->uart_nr);
		auto len = std::min(uint32_t(size - read), uart_ll_get_rxfifo_len(dev));
		uart_ll_read_rxfifo(dev, &buf[read], len);
		read += len;

		// FIFO full may have been disabled if buffer overflowed, re-enabled it now
		uart_ll_clr_intsts_mask(dev, UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT | UART_INTR_RXFIFO_OVF);
		uart_ll_ena_intr_mask(dev, UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT | UART_INTR_RXFIFO_OVF);
	}
#if UART_ID_SERIAL_USB_JTAG
	else if(is_usb_serial_jtag(uart)) {
		auto len = usb_serial_jtag_ll_read_rxfifo(&buf[read], size - read);
		read += len;
	}
#endif

	return read;
}

size_t smg_uart_rx_available(smg_uart_t* uart)
{
	if(!smg_uart_rx_enabled(uart)) {
		return 0;
	}

	smg_uart_disable_interrupts();

	size_t avail = 0;
	if(is_standard_uart(uart)) {
		auto dev = getDevice(uart->uart_nr);
		avail = uart_ll_get_rxfifo_len(dev);
	}

	if(uart->rx_buffer != nullptr) {
		avail += uart->rx_buffer->available();
	}

	smg_uart_restore_interrupts();

