SmingHub/Sming/Sming/Arch/Esp32/Components/driver/uart.cpp
	return avail;
}

void smg_uart_start_isr(smg_uart_t* uart)
{
	if(!is_physical(uart)) {
		return;
	}

	int interrupt_source;
	intr_handler_t interrupt_handler;

#if UART_ID_SERIAL_USB_JTAG
	if(is_usb_serial_jtag(uart)) {
		usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY |
										   USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT);
		usb_serial_jtag_ll_ena_intr_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY |
										 USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT);

		interrupt_source = ETS_USB_SERIAL_JTAG_INTR_SOURCE;
		interrupt_handler = reinterpret_cast<intr_handler_t>(usb_serial_jtag_isr);
	} else
#endif
	{
		uint32_t int_ena{0};

		auto dev = getDevice(uart->uart_nr);
		dev->conf1.val = 0;

		if(smg_uart_rx_enabled(uart)) {
			uart_ll_set_rxfifo_full_thr(dev, RX_FIFO_FULL_THRESHOLD);
			uart_ll_set_rx_tout(dev, 10);

			/*
		 * There is little benefit in generating interrupts on errors, instead these
		 * should be cleared at the start of a transaction and checked at the end.
		 * See uart_get_status().
		 */
			int_ena |= UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT | UART_INTR_BRK_DET | UART_INTR_RXFIFO_OVF;
		}

		if(smg_uart_tx_enabled(uart)) {
			/*
		 * We can interrupt when TX FIFO is empty; at 1Mbit that gives us 800 CPU
		 * cycles before the last character has actually gone over the wire. Even if
		 * a gap occurs it is unlike to cause any problems. It also makes the callback
		 * more useful, for example if using it for RS485 we'd then want to reverse
		 * transfer direction and begin waiting for a response.
		 */

			// TX FIFO empty interrupt only gets enabled via uart_write function()
			uart_ll_set_txfifo_empty_thr(dev, 10);
		}

		dev->int_clr.val = 0x0007ffff;
		dev->int_ena.val = int_ena;

		interrupt_source = uart_periph_signal[uart->uart_nr].irq;
		interrupt_handler = reinterpret_cast<intr_handler_t>(uart_isr);
	}

	smg_uart_disable_interrupts();
	auto& inst = uartInstances[uart->uart_nr];
	esp_intr_alloc(interrupt_source, ESP_INTR_FLAG_IRAM, interrupt_handler, &inst, &inst.handle);
	smg_uart_restore_interrupts();
	bitSet(isrMask, uart->uart_nr);
}

size_t smg_uart_write(smg_uart_t* uart, const void* buffer, size_t size)
{
	if(!smg_uart_tx_enabled(uart) || buffer == nullptr || size == 0) {
		return 0;
	}

	size_t written = 0;

	auto buf = static_cast<const uint8_t*>(buffer);

	while(written < size) {
		// If TX buffer not in use or it's empty then write directly to hardware FIFO
		if(uart->tx_buffer == nullptr || uart->tx_buffer->isEmpty()) {
			if(is_standard_uart(uart)) {
				auto dev = getDevice(uart->uart_nr);
				auto len = std::min(size - written, uart_txfifo_free(dev));
				uart_ll_write_txfifo(dev, &buf[written], len);
				written += len;
				// Enable TX FIFO EMPTY interrupt
				uart_ll_clr_intsts_mask(dev, UART_INTR_TXFIFO_EMPTY);
				uart_ll_ena_intr_mask(dev, UART_INTR_TXFIFO_EMPTY);
			}
#if UART_ID_SERIAL_USB_JTAG
			else if(is_usb_serial_jtag(uart)) {
				usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);
				auto len = usb_serial_jtag_ll_write_txfifo(&buf[written], size - written);
				written += len;
				usb_serial_jtag_ll_txfifo_flush();
				// Enable TX FIFO EMPTY interrupt
				usb_serial_jtag_ll_ena_intr_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);
			}
#endif
		}

		// Write any remaining data into transmit buffer
		if(uart->tx_buffer != nullptr) {
			while(written < size && uart->tx_buffer->writeChar(buf[written])) {
				++written;
			}
		}

		notify(uart, UART_NOTIFY_AFTER_WRITE);

		if(!bitRead(uart->options, UART_OPT_TXWAIT)) {
			break;
		}
	}

	return written;
}

size_t smg_uart_tx_free(smg_uart_t* uart)
{
	if(!smg_uart_tx_enabled(uart)) {
		return 0;
	}

	smg_uart_disable_interrupts();

	size_t space = 0;
	if(is_standard_uart(uart)) {
		auto dev = getDevice(uart->uart_nr);
		space = uart_txfifo_free(dev);
	}
	if(uart->tx_buffer != nullptr) {
		space += uart->tx_buffer->getFreeSpace();
	}

	smg_uart_restore_interrupts();

	return space;
}

void smg_uart_wait_tx_empty(smg_uart_t* uart)
{
	if(!smg_uart_tx_enabled(uart)) {
		return;
	}

	notify(uart, UART_NOTIFY_WAIT_TX);

	if(uart->tx_buffer != nullptr) {
		while(!uart->tx_buffer->isEmpty()) {
			system_soft_wdt_feed();
		}
	}

	if(is_standard_uart(uart)) {
		auto dev = getDevice(uart->uart_nr);
		while(uart_txfifo_count(dev) != 0) {
			system_soft_wdt_feed();
		}
	}
#if UART_ID_SERIAL_USB_JTAG
	else if(is_usb_serial_jtag(uart)) {
		while(!usb_serial_jtag_ll_txfifo_writable()) {
			system_soft_wdt_feed();
		}
	}
#endif
}

void smg_uart_set_break(smg_uart_t* uart, bool state)
{
	uart = get_standard_uart(uart);
	if(uart != nullptr) {
		auto dev = getDevice(uart->uart_nr);
		dev->conf0.txd_brk = state;
	}
}

uint8_t smg_uart_get_status(smg_uart_t* uart)
{
	uint32_t status{0};
	if(uart != nullptr) {
		smg_uart_disable_interrupts();
		// Get break/overflow flags from actual uart (physical or otherwise)
		status = uart->status & (UART_INTR_BRK_DET | UART_INTR_RXFIFO_OVF);
		uart->status = 0;
		// Read raw status register directly from real uart, masking out non-error bits
		uart = get_standard_uart(uart);
		if(uart != nullptr) {
			auto dev = getDevice(uart->uart_nr);
			status |= dev->int_raw.val &
					  (UART_INTR_BRK_DET | UART_INTR_RXFIFO_OVF | UART_INTR_FRAM_ERR | UART_INTR_PARITY_ERR);
			// Clear errors
			uart_ll_clr_intsts_mask(dev, status);
		}
		smg_uart_restore_interrupts();
	}

	return status;
}

void smg_uart_flush(smg_uart_t* uart, smg_uart_mode_t mode)
{
	if(uart == nullptr) {
		return;
	}

	bool flushRx = mode != UART_TX_ONLY && uart->mode != UART_TX_ONLY;
	bool flushTx = mode != UART_RX_ONLY && uart->mode != UART_RX_ONLY;

	smg_uart_disable_interrupts();
	if(flushRx && uart->rx_buffer != nullptr) {
		uart->rx_buffer->clear();
	}

	if(flushTx && uart->tx_buffer != nullptr) {
		uart->tx_buffer->clear();
	}

	if(is_standard_uart(uart)) {
		auto dev = getDevice(uart->uart_nr);

		if(flushTx) {
			// Prevent TX FIFO EMPTY interrupts - don't need them until uart_write is called again
			uart_ll_disable_intr_mask(dev, UART_INTR_TXFIFO_EMPTY);
			uart_ll_txfifo_rst(dev);
		}

		// If receive overflow occurred then these interrupts will be masked
		if(flushRx) {
			uart_ll_rxfifo_rst(dev);
			dev->int_clr.val = 0x0007ffff & ~UART_INTR_TXFIFO_EMPTY;
			uart_ll_ena_intr_mask(dev, UART_INTR_RXFIFO_FULL | UART_INTR_RXFIFO_TOUT | UART_INTR_RXFIFO_OVF);
		}
	}

	smg_uart_restore_interrupts();
}

