SmingHub/Sming/Sming/Arch/Esp32/Components/driver/uart.cpp
uint32_t smg_uart_set_baudrate_reg(int uart_nr, uint32_t baud_rate)
{
	if(!is_standard_uart(uart_nr) || baud_rate == 0) {
		return 0;
	}

	auto dev = getDevice(uart_nr);

	// Return the actual baud rate in use
#if ESP_IDF_VERSION_MAJOR < 5
	uart_ll_set_sclk(dev, UART_SCLK_APB);
	uart_ll_set_baudrate(dev, baud_rate);
	return uart_ll_get_baudrate(dev);
#else
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
	uart_ll_set_sclk(dev, UART_SCLK_DEFAULT);
#else
	uart_ll_set_sclk(dev, soc_module_clk_t(UART_SCLK_DEFAULT));
#endif
	uart_ll_set_baudrate(dev, baud_rate, APB_CLK_FREQ);
	return uart_ll_get_baudrate(dev, APB_CLK_FREQ);
#endif
}

uint32_t smg_uart_set_baudrate(smg_uart_t* uart, uint32_t baud_rate)
{
	uart = get_standard_uart(uart);
	if(uart == nullptr) {
		return 0;
	}

	baud_rate = smg_uart_set_baudrate_reg(uart->uart_nr, baud_rate);
	// Store the actual baud rate in use
	uart->baud_rate = baud_rate;
	return baud_rate;
}

uint32_t smg_uart_get_baudrate(smg_uart_t* uart)
{
	uart = get_standard_uart(uart);
	return (uart == nullptr) ? 0 : uart->baud_rate;
}

smg_uart_t* smg_uart_init_ex(const smg_uart_config_t& cfg)
{
	// Already initialised?
	if(cfg.uart_nr >= UART_PHYSICAL_COUNT || uartInstances[cfg.uart_nr].uart != nullptr) {
		return nullptr;
	}

	auto mem = heap_caps_malloc(sizeof(smg_uart_t), MALLOC_CAP_DEFAULT | MALLOC_CAP_INTERNAL);
	auto uart = new(mem) smg_uart_t{};
	if(uart == nullptr) {
		return nullptr;
	}

	uart->uart_nr = cfg.uart_nr;
	uart->mode = cfg.mode;
	uart->options = cfg.options;
	uart->rx_headroom = DEFAULT_RX_HEADROOM;

	int tx_pin = cfg.tx_pin;
	int rx_pin = cfg.rx_pin;

	auto rxBufferSize = cfg.rx_size;
	auto txBufferSize = cfg.tx_size;

	if(smg_uart_rx_enabled(uart)) {
		if(!smg_uart_realloc_buffer(uart->rx_buffer, rxBufferSize)) {
			delete uart;
			return nullptr;
		}
		rx_pin = (cfg.rx_pin == UART_PIN_DEFAULT) ? defaultPins[cfg.uart_nr].rx : cfg.rx_pin;
	} else {
		rx_pin = UART_PIN_NO_CHANGE;
	}

	if(smg_uart_tx_enabled(uart)) {
		if(!smg_uart_realloc_buffer(uart->tx_buffer, txBufferSize)) {
			delete uart->rx_buffer;
			delete uart;
			return nullptr;
		}
		tx_pin = (tx_pin == UART_PIN_DEFAULT) ? defaultPins[cfg.uart_nr].tx : cfg.tx_pin;
	} else {
		tx_pin = UART_PIN_NO_CHANGE;
	}

	// OK, buffers allocated so setup hardware
	smg_uart_detach(cfg.uart_nr);
	smg_uart_set_pins(uart, tx_pin, rx_pin);

	if(is_standard_uart(uart)) {
		auto& conn = uart_periph_signal[cfg.uart_nr];

		periph_module_enable(conn.module);

		auto dev = getDevice(cfg.uart_nr);

// Workaround for ESP32C3: enable core reset before enabling uart module clock to prevent uart output garbage value.
#if SOC_UART_REQUIRE_CORE_RESET
		uart_ll_set_reset_core(dev, true);
		periph_module_reset(conn.module);
		uart_ll_set_reset_core(dev, false);
#else
		periph_module_reset(conn.module);
#endif

		uart_ll_set_mode(dev, UART_MODE_UART);
		uart_ll_set_tx_idle_num(dev, 0);

		// Bottom 8 bits identical to esp8266
		dev->conf0.val = (dev->conf0.val & 0xFFFFFF00) | cfg.format;
	}
#if UART_ID_SERIAL_USB_JTAG
	else if(is_usb_serial_jtag(uart)) {
		USJ_RCC_ATOMIC()
		{
			usb_serial_jtag_ll_enable_bus_clock(true);
		}
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
		usb_fsls_phy_ll_int_jtag_enable(&USB_SERIAL_JTAG);
#else
		usb_phy_ll_int_jtag_enable(&USB_SERIAL_JTAG);
#endif
	}
#endif

	smg_uart_set_baudrate(uart, cfg.baudrate);
	smg_uart_flush(uart);
	uartInstances[cfg.uart_nr].uart = uart;
	smg_uart_start_isr(uart);

	notify(uart, UART_NOTIFY_AFTER_OPEN);

	return uart;
}

void smg_uart_uninit(smg_uart_t* uart)
{
	if(uart == nullptr) {
		return;
	}

	notify(uart, UART_NOTIFY_BEFORE_CLOSE);

	smg_uart_stop_isr(uart);
	// If debug output being sent to this UART, disable it
	if(uart->uart_nr == s_uart_debug_nr) {
		smg_uart_set_debug(UART_NO);
	}

	auto& conn = uart_periph_signal[uart->uart_nr];
	periph_module_disable(conn.module);

	uartInstances[uart->uart_nr].uart = nullptr;
	delete uart->rx_buffer;
	delete uart->tx_buffer;
	delete uart;
}

void smg_uart_set_format(smg_uart_t* uart, smg_uart_format_t format)
{
	uart = get_standard_uart(uart);
	if(uart == nullptr) {
		return;
	}
	smg_uart_config_format_t fmt{.val = format};
	auto dev = getDevice(uart->uart_nr);
	uart_ll_set_data_bit_num(dev, uart_word_length_t(fmt.bits));
	uart_ll_set_parity(dev, uart_parity_t(fmt.parity));
	uart_ll_set_stop_bits(dev, uart_stop_bits_t(fmt.stop_bits));
}

bool smg_uart_intr_config(smg_uart_t* uart, const smg_uart_intr_config_t* config)
{
	uart = get_standard_uart(uart);
	if(uart == nullptr || config == nullptr) {
		return false;
	}

	auto dev = getDevice(uart->uart_nr);
	if(smg_uart_rx_enabled(uart)) {
		uint8_t full_threshold;
		if(uart->rx_buffer == nullptr) {
			// Setting this to 0 results in lockup as the interrupt never clears
			full_threshold = TRange(1U, unsigned(UART_RXFIFO_FULL_THRHD)).clip(config->rxfifo_full_thresh);
		} else {
			full_threshold = RX_FIFO_FULL_THRESHOLD;
		}
		uart_ll_set_rxfifo_full_thr(dev, full_threshold);
		uart_ll_set_rx_tout(dev, TRange(0U, unsigned(UART_RX_TOUT_THRHD)).clip(config->rx_timeout_thresh));
	}

	if(smg_uart_tx_enabled(uart)) {
		uart_ll_set_txfifo_empty_thr(
			dev, TRange(0U, unsigned(UART_TXFIFO_EMPTY_THRHD)).clip(config->txfifo_empty_intr_thresh));
	}

	dev->int_clr.val = config->intr_mask;
	dev->int_ena.val = (dev->int_ena.val & ~config->intr_mask) | config->intr_enable;

	return true;
}

void smg_uart_swap(smg_uart_t*, int)
{
	// Not implemented
}

bool smg_uart_set_tx(smg_uart_t* uart, int tx_pin)
{
	return uart == nullptr ? false : smg_uart_set_pins(uart, tx_pin, -1);
}

bool smg_uart_set_pins(smg_uart_t* uart, int tx_pin, int rx_pin)
{
	if(uart == nullptr) {
		return false;
	}

	if(tx_pin != UART_PIN_NO_CHANGE && !GPIO_IS_VALID_OUTPUT_GPIO(tx_pin)) {
		return false;
	}

	if(rx_pin != UART_PIN_NO_CHANGE && !GPIO_IS_VALID_OUTPUT_GPIO(rx_pin)) {
		return false;
	}

	auto& conn = uart_periph_signal[uart->uart_nr];

	if(tx_pin != UART_PIN_NO_CHANGE) {
		gpio_ll_iomux_func_sel(GPIO_PIN_MUX_REG[tx_pin], PIN_FUNC_GPIO);
		gpio_set_level(gpio_num_t(tx_pin), true);
#ifdef SOC_UART_TX_PIN_IDX
		gpio_matrix_out(tx_pin, conn.pins[SOC_UART_TX_PIN_IDX].signal, false, false);
#else
		gpio_matrix_out(tx_pin, conn.tx_sig, false, false);
#endif
		uart->tx_pin = tx_pin;
	}

	if(rx_pin != UART_PIN_NO_CHANGE) {
		gpio_ll_iomux_func_sel(GPIO_PIN_MUX_REG[rx_pin], PIN_FUNC_GPIO);
		gpio_set_pull_mode(gpio_num_t(rx_pin), GPIO_PULLUP_ONLY);
		gpio_set_direction(gpio_num_t(rx_pin), GPIO_MODE_INPUT);
#ifdef SOC_UART_RX_PIN_IDX
		gpio_matrix_in(rx_pin, conn.pins[SOC_UART_RX_PIN_IDX].signal, false);
#else
		gpio_matrix_in(rx_pin, conn.rx_sig, false);
#endif
	}

