SmingHub/Sming/Sming/Arch/Esp32/Components/driver/uart.cpp
	return true;
}

void smg_uart_debug_putc(char c)
{
	smg_uart_t* uart = smg_uart_get_uart(s_uart_debug_nr);
	if(uart != nullptr) {
		smg_uart_write_char(uart, c);
	}
}

void smg_uart_set_debug(int uart_nr)
{
	s_uart_debug_nr = uart_nr;
	ets_install_putc1(smg_uart_debug_putc);
	ets_install_putc2(nullptr);
}

int smg_uart_get_debug()
{
	return s_uart_debug_nr;
}

void smg_uart_detach(int uart_nr)
{
	if(!is_physical(uart_nr)) {
		return;
	}

	smg_uart_disable_interrupts();

	if(bitRead(isrMask, uart_nr)) {
		auto& inst = uartInstances[uart_nr];
		esp_intr_free(inst.handle);
		inst.handle = nullptr;
		bitClear(isrMask, uart_nr);
	}

	if(is_standard_uart(uart_nr)) {
		auto dev = getDevice(uart_nr);
		dev->conf1.val = 0;
		dev->int_clr.val = 0x0007ffff;
		dev->int_ena.val = 0;
	}
#if UART_ID_SERIAL_USB_JTAG
	else if(is_usb_serial_jtag(uart_nr)) {
		// NB. Don't disable module clock or usb_pad_enable since the "USJ stdout might still depends on it" ?
		usb_serial_jtag_ll_disable_intr_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY |
											 USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT);
	}
#endif
	smg_uart_restore_interrupts();
}

void smg_uart_detach_all()
{
	smg_uart_disable_interrupts();
	for(unsigned uart_nr = 0; uart_nr < SOC_UART_NUM; ++uart_nr) {
		if(bitRead(isrMask, uart_nr)) {
			auto& inst = uartInstances[uart_nr];
			esp_intr_free(inst.handle);
			inst.handle = nullptr;
		}
		auto dev = getDevice(uart_nr);
		// Wait for any outgoing data to finish sending (e.g. at boot time)
		while(uart_txfifo_count(dev) != 0) {
		}
		dev->conf1.val = 0;
		dev->int_clr.val = 0x0007ffff;
		dev->int_ena.val = 0;
	}
	isrMask = 0;
}
